app/controllers/rides_controller.rb

 def start_ride

      @cab = Cab.find(params[:cab_id])

     if @cab.present?
      @ride = Ride.new(:cab_id => @cab.id , :start_latitude => params[:start_latitude] ,:start_longitude => params[:start_longitude])
      @ride.save

      @cab.update(:available => false)
---
SELECT "cabs".* FROM "cabs" WHERE "cabs"."id" = ? LIMIT 1  [["id", ""]]
INSERT INTO "rides" ("cab_id", "created_at", "start_latitude", "start_longitude", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cab_id", 1.0], ["created_at", Tue, 19 Jul 2016 08:03:47 UTC +00:00], ["start_latitude", 3.0], ["start_longitude", 3.0], ["updated_at", Tue, 19 Jul 2016 08:03:47 UTC +00:00]]
UPDATE "cabs" SET "available" = ?, "updated_at" = ? WHERE "cabs"."id" = 1  [["available", false], ["updated_at", Tue, 19 Jul 2016 08:02:35 UTC +00:00]]

 def end_ride
   @ride = Ride.find(params[:ride_id])
   @ride.update(:end_latitude => params[:end_latitude] ,:end_longitude => params[:end_longitude])

   @cab = Cab.find(@ride.cab_id)
   @cab.update(:available => true,:latitude => params[:end_latitude] ,:longitude => params[:end_longitude])
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "rides" SET "end_latitude" = ?, "end_longitude" = ?, "updated_at" = ? WHERE "rides"."id" = 1  [["end_latitude", 5.0], ["end_longitude", 5.0], ["updated_at", Tue, 19 Jul 2016 08:40:28 UTC +00:00]]
SELECT "cabs".* FROM "cabs" WHERE "cabs"."id" = ? LIMIT 1  [["id", 1.0]]
UPDATE "cabs" SET "available" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "cabs"."id" = 5  [["available", true], ["latitude", 15.0], ["longitude", 15.0], ["updated_at", Tue, 19 Jul 2016 16:19:14 UTC +00:00]]